using System;
Console.Clear();

/* Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

456 -> 5
782 -> 8
918 -> 1 */

Console.WriteLine("Введите трехзначное число");
int N=Convert.ToInt32(Console.ReadLine());
N = N[1];
Console.WriteLine(result);